package com.naver.erp;


import java.util.List;
import java.util.Map;

//*********************************************
//[BoardDAO 인터페이스] 선언
//*********************************************
public interface User_infoDAO {
	 
	
	//**************************************************
	// [회원가입 정보의 개수] 바디없는 메소드 선언 
	//*************************************************
	int insertMember(User_infoDTO user_infoDTO);
	
	
	
	//**************************************************
	// [로그인ID,암호의 존재개수 얻기] 바디없는 메소드 선언 
	//**************************************************
	int getVerifyCnt(Map<String, String> verify_idJumin);


	//**************************************************
	// [회원 관리 성공 개수] 바디없는 메소드 선언 
	//**************************************************
	int insertAccess(User_infoDTO user_infoDTO);
     
	   
	 
}
